# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Thu Jun 25 11:59:16 IST 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design mac_array

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports en]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a0[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a0[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a0[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a0[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a0[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a0[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a0[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a0[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a3[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a3[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a3[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a3[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a3[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a3[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a3[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {a3[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b0[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b0[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b0[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b0[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b0[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b0[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b0[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b0[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b3[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b3[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b3[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b3[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b3[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b3[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b3[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {b3[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports {y3[0]}]
